{
  "text": "Company Number: 507913\nBLL Management Services Limited\nAbridged Unaudited Financial Statements\nfor the financial year ended 31 December 2022\n\nBLL Management Services Limited\nCONTENTS\nPage\nDirectors' Responsibilities Statement 3\nBalance Sheet 4 - 5\nNotes to the Financial Statements 6 - 9\n2\n\nBLL Management Services Limited\nDIRECTORS' RESPONSIBILITIES STATEMENT\nfor the financial year ended 31 December 2022\nThe directors are responsible for preparing the Directors' Report and the financial statements in accordance with\napplicable Irish law and regulations.\nIrish company law requires the directors to prepare financial statements for each financial year. Under the law the\ndirectors have elected to prepare the financial statements in accordance with the Companies Act 2014 and FRS 102\n\"The Financial Reporting Standard applicable in the UK and Republic of Ireland\", applying Section 1A of that\nStandard, issued by the Financial Reporting Council. Under company law, the directors must not approve the\nfinancial statements unless they are satisfied that they give a true and fair view of the assets, liabilities and financial\nposition of the company as at the financial year end date and of the profit or loss of the company for the financial\nyear and otherwise comply with the Companies Act 2014.\nIn preparing these financial statements, the directors are required to:\n- select suitable accounting policies for the company financial statements and then apply them consistently;\n- make judgements and accounting estimates that are reasonable and prudent;\n- state whether the financial statements have been prepared in accordance with applicable accounting standards,\nidentify those standards, and note the effect and the reasons for any material departure from those standards;\nand\n- prepare the financial statements on the going concern basis unless it is inappropriate to presume that the\ncompany will continue in business.\nThe directors are responsible for ensuring that the company keeps or causes to be kept adequate accounting\nrecords which correctly explain and record the transactions of the company, enable at any time the assets, liabilities,\nfinancial position and profit or loss of the company to be determined with reasonable accuracy, enable them to\nensure that the financial statements and Directors' Report comply with the Companies Act 2014. They are also\nresponsible for safeguarding the assets of the company and hence for taking reasonable steps for the prevention\nand detection of fraud and other irregularities.\nSigned on behalf of the board\n[ ] [ ]\nBarbara Kavanagh John Manley\nDirector Director\n15 June 2023 15 June 2023\n3\n\nBLL Management Services Limited\nBALANCE SHEET\nas at 31 December 2022\n2022 2021\nNotes € €\nFixed Assets\nTangible assets 6 1,854 2,271\nInvestments 7 233,259 233,259\n─────── ───────\n235,113 235,530\n─────── ───────\nCurrent Assets\nStocks 8 222,960 37,880\nDebtors 9 5,293 33,555\nCash and cash equivalents 315,630 92,548\n─────── ───────\n543,883 163,983\n─────── ───────\nCreditors: amounts falling due within one year 10 (94,792) (55,292)\n─────── ───────\nNet Current Assets 449,091 108,691\n─────── ───────\nTotal Assets less Current Liabilities 684,204 344,221\n═══════ ═══════\nCapital and Reserves\nCalled up share capital presented as equity 2 2\nRetained earnings 684,202 344,219\n─────── ───────\nShareholders' Funds 684,204 344,221\n═══════ ═══════\nThe notes on pages 6 to 9 form part of the abridged financial statements 4\n\nBLL Management Services Limited\nBALANCE SHEET\nas at 31 December 2022\nThe financial statements have been prepared in accordance with the provisions applicable to companies subject to\nthe small companies' regime and in accordance with FRS 102 \"The Financial Reporting Standard applicable in the\nUK and Republic of Ireland\", applying Section 1A of that Standard.\nWe as Directors of BLL Management Services Limited, state that -\n(a) the company is availing itself of the exemption provided for by Chapter 15 of Part 6 of the Companies Act 2014,\n(b) the company is availing itself of the exemption on the grounds that the conditions specified in section 358 are\nsatisfied,\n(c) the shareholders of the company have not served a notice on the company under section 334(1) in accordance\nwith section 334(2),\n(d) we acknowledge the company’s obligations under the Companies Act 2014, to keep adequate accounting records\nand prepare financial statements which give a true and fair view of the assets, liabilities and financial position of the\ncompany at the end of its financial year and of its profit or loss for such a financial year and to otherwise comply with\nthe provisions of the Companies Act 2014 relating to financial statements so far as they are applicable to the\ncompany,\n(e) the company has relied on the specified exemption contained in section 352 Companies Act 2014. The company\nhas done so on the grounds that the company is entitled to the benefit of that exemption as a small company and the\nabridged financial statements have been properly prepared in accordance with section 353 Companies Act 2014 and\nthe small companies' regime.\nApproved by the board on 15 June 2023 and signed on its behalf by:\n[ ] [ ]\nBarbara Kavanagh John Manley\nDirector Director\nThe notes on pages 6 to 9 form part of the abridged financial statements 5\n\nBLL Management Services Limited\nNOTES TO THE ABRIDGED FINANCIAL STATEMENTS\nfor the financial year ended 31 December 2022\n1. General Information\nBLL Management Services Limited is a company limited by shares incorporated and registered in the\nRepublic of Ireland. The registered number of the company is 507913. The registered office of the company\nis 46 Old Mill Race, Athgarvan, Kildare. The principal activity of the company continued to be that of the\nprovision of technical and consulting services to the manufacturing and construction sector. The financial\nstatements have been presented in Euro (€) which is also the functional currency of the company.\n2. Summary of Significant Accounting Policies\nThe following accounting policies have been applied consistently in dealing with items which are considered\nmaterial in relation to the company's financial statements.\nStatement of compliance\nThe financial statements of the company for the financial year ended 31 December 2022 have been prepared\nin accordance with the provisions of FRS 102 Section 1A (Small Entities) and the Companies Act 2014.\nBasis of preparation\nThe financial statements have been prepared on the going concern basis and in accordance with the\nhistorical cost convention except for certain properties and financial instruments that are measured at\nrevalued amounts or fair values, as explained in the accounting policies below. Historical cost is generally\nbased on the fair value of the consideration given in exchange for assets. The financial reporting framework\nthat has been applied in their preparation is the Companies Act 2014 and FRS 102 \"The Financial Reporting\nStandard applicable in the UK and Republic of Ireland\" Section 1A, issued by the Financial Reporting\nCouncil.\nThe company qualifies as a small company as defined by section 280A of the Companies Act 2014 in respect\nof the financial year, and has applied the rules of the ‘Small Companies Regime’ in accordance with section\n280C of the Companies Act 2014 and Section 1A of FRS 102.\nTurnover\nTurnover comprises the invoice value of services supplied by the company, exclusive of trade discounts and\nvalue added tax.\nTangible assets and depreciation\nTangible assets are stated at cost or at valuation, less accumulated depreciation. The charge to depreciation\nis calculated to write off the original cost or valuation of tangible assets, less their estimated residual value,\nover their expected useful lives as follows:\nFixtures, fittings and equipment - over 8 years\nWhere there is objective evidence that recoverable amounts of an asset is less than its carrying value the\ncarrying amount of the asset is reduced to its recoverable amount resulting in an impairment loss. Impairment\nlosses are recognised immediately in the profit and loss account, with the exception of losses on previously\nrevalued tangible fixed assets, which are recognised in other comprehensive income to the extent of any\npreviously recognised revaluation increase accumulated in equity, in respect of that asset.\nWhere the circumstances causing an impairment of an asset no longer apply, then the impairment is\nreversed through the profit and loss account, except for impairments on previously revalued tangible assets,\nwhich are treated as revaluation increases to the extent that the revaluation was recognised in equity.\nThe recoverable amount of tangible fixed assets, goodwill and other intangible fixed assets is the higher of\nthe fair value less cost to sell of the asset and its value in use. The value in use of these assets is the present\nvalue of the cash flows expected to be derived from those assets. This is determined by reference to the\npresent value of the future cash flows of the company which is considered by the directors to be a single\ncash generating unit.\nInvestments\nThe company holds investments in unlisted non-puttable equity shares of a number of entities. It is\nconsidered by the directors that the fair value of these shares cannot be measured reliably. These\ninvestments are measured at cost less impairment.\n6\n\nBLL Management Services Limited\nNOTES TO THE ABRIDGED FINANCIAL STATEMENTS continued\nfor the financial year ended 31 December 2022\nStocks\nStocks are valued at the lower of cost and net realisable value. Cost comprises expenditure incurred in the\nnormal course of business in bringing stocks to their present location and condition. Full provision is made\nfor obsolete and slow moving items. Net realisable value comprises actual or estimated selling price (net of\ntrade discounts) less all further costs to completion or to be incurred in marketing and selling.\nTrade and other debtors\nTrade and other debtors are initially recognised at fair value and thereafter stated at amortised cost using the\neffective interest method less impairment losses for bad and doubtful debts except where the effect of\ndiscounting would be immaterial. In such cases the receivables are stated at cost less impairment losses for\nbad and doubtful debts.\nCash and cash equivalents\nCash consists of cash on hand and demand deposits. Cash equivalents consist of short term highly liquid\ninvestments that are readily convertible to known amounts of cash that are subject to an insignificant risk of\nchange in value.\nTrade and other creditors\nTrade and other creditors are initially recognised at fair value and thereafter stated at amortised cost using\nthe effective interest rate method, unless the effect of discounting would be immaterial, in which case they\nare stated at cost.\nEmployee benefits\nThe company operates a defined contribution pension scheme for employees. The assets of the scheme are\nheld separately from those of the company. Annual contributions payable to the company’s pension scheme\nare charged to the Profit and Loss Account in the period to which they relate.\nTaxation and deferred taxation\nCurrent tax represents the amount expected to be paid or recovered in respect of taxable profits for the\nfinancial year and is calculated using the tax rates and laws that have been enacted or substantially enacted\nat the Balance Sheet date.\nDeferred tax is recognised in respect of all timing differences that have originated but not reversed at the\nbalance sheet date where transactions or events have occurred at that date that will result in an obligation to\npay more tax in the future, or a right to pay less tax in the future. Timing differences are temporary\ndifferences between the company's taxable profits and its results as stated in the financial statements.\nDeferred tax is measured on an undiscounted basis at the tax rates that are anticipated to apply in the\nperiods in which the timing differences are expected to reverse, based on tax rates and laws that have been\nenacted or substantively enacted by the balance sheet date.\nForeign currencies\nMonetary assets and liabilities denominated in foreign currencies are retranslated at the rate of exchange\nruling at the financial year end date. Non monetary items that are measured at historical cost are translated\nat the foreign exchange rate ruling at the date of the transaction. Non-monetary items measured at fair value\nare translated at the rate of exchange at the date of the valuation. All foreign exchange differences are\ntaken to the profit and loss account.\nFinancial Instruments\nLoans and other borrowings\nAll loans and borrowings, both assets and liabilities are initially recorded at the present value of cash payable\nto the lender in settlement of the liability discounted at the market interest rate. Subsequently loans and\nborrowings are stated at amortised cost using the effective interest rate method. The computation of\namortised cost includes any issue costs, transaction costs and fees, and any discount or premium on\nsettlement, and the effect of this is to amortise these amounts over the expected borrowing period. Loans\nwith no stated interest rate and repayable within one year or on demand are not amortised. Loans and\nborrowings are classified as current assets or liabilities unless the borrower has an unconditional right to\ndefer settlement of the liability for at least twelve months after the financial year end date.\nOrdinary share capital\nThe ordinary share capital of the company is presented as equity.\n7\n\nBLL Management Services Limited\nNOTES TO THE ABRIDGED FINANCIAL STATEMENTS continued\nfor the financial year ended 31 December 2022\n3. Operating profit 2022 2021\n€ €\nOperating profit is stated after charging:\nDepreciation of tangible assets 417 289\n═══════ ═══════\n4. Other Gains and Losses 2022 2021\n€ €\nFair value gains and losses are as follows:\nInvestments in shares - (20,000)\n═══════ ═══════\n5. Employees\nThe average monthly number of employees, including directors, during the financial year was 3, (2021 - 2).\n6. Tangible assets\nFixtures, Total\nfittings and\nequipment\n€ €\nCost\nAt 1 January 2022 8,977 8,977\n─────── ───────\nAt 31 December 2022 8,977 8,977\n─────── ───────\nDepreciation\nAt 1 January 2022 6,706 6,706\nCharge for the financial year 417 417\n─────── ───────\nAt 31 December 2022 7,123 7,123\n─────── ───────\nNet book value\nAt 31 December 2022 1,854 1,854\n═══════ ═══════\nAt 31 December 2021 2,271 2,271\n═══════ ═══════\n7. Investments\nOther Total\nunlisted\ninvestments\nInvestments € €\nCost\nAt 31 December 2022 233,259 233,259\n─────── ───────\nNet book value\nAt 31 December 2022 233,259 233,259\n═══════ ═══════\nAt 31 December 2021 233,259 233,259\n═══════ ═══════\n8. Stocks 2022 2021\n€ €\nWork in progress 222,960 37,880\n═══════ ═══════\n8\n\nBLL Management Services Limited\nNOTES TO THE ABRIDGED FINANCIAL STATEMENTS continued\nfor the financial year ended 31 December 2022\n9. Debtors 2022 2021\n€ €\nTrade debtors - 20,572\nDirectors' current accounts 4,234 2,378\nTaxation - 10,011\nPrepayments 1,059 594\n─────── ───────\n5,293 33,555\n═══════ ═══════\n10. Creditors 2022 2021\nAmounts falling due within one year € €\nTrade creditors - 26,586\nTaxation 93,422 25,363\nOther creditors 482 143\nAccruals 888 3,200\n─────── ───────\n94,792 55,292\n═══════ ═══════\n11. Income Statement\n2022 2021\n€ €\nAt 1 January 2022 344,219 343,580\nProfit for the financial year 339,983 639\n─────── ───────\nAt 31 December 2022 684,202 344,219\n═══════ ═══════\n12. Capital commitments\nThe company had no material capital commitments at the financial year-ended 31 December 2022.\n13. Directors' remuneration 2022 2021\n€ €\nRemuneration 145,822 145,352\nPension contributions 56,955 104,243\n─────── ───────\n202,777 249,595\n═══════ ═══════\n14. Controlling interest\nThe company is ultimately owned and controlled by John Manley & Barbara Kavanagh.\n15. Post-Balance Sheet Events\nThere have been no significant events affecting the company since the financial year-end.\n16. Approval of financial statements\nThe financial statements were approved and authorised for issue by the board of directors on 15 June 2023.\n9"
}